"""
Задача 1: Визначення парності числа
Запросити користувача ввести ціле число.
Вивести повідомлення, що число є парним, якщо воно ділиться
на 2 без залишку, або непарним у іншому випадку.
"""

number = int(input("Введіть своє число: "))
if number % 2 == 0:
    print("Парне число")
else:
    print("Не парне число")
