"""
Задача 2: Визначення четверті чверті координатної площини
Запросити користувача ввести координати точки (x, y) на координатній площині.
Вивести повідомлення про те, в якій чверті
знаходиться точка (1-я, 2-га, 3-тя або 4-та).
"""
x = int(input("X: "))
y = int(input("Y: "))

if x > 0 and y > 0:
    print("1 Чверть")   
elif x < 0 and y > 0:
    print("2 Чверть")
elif x < 0 and y < 0:
    print("3 Чверть")
elif x > 0 and y < 0:
    print("4 Чверть")
else:
    print("То*чка на осі")