"""
Задача 1: Знаходження суми елементів списку
Створити список з числовими значеннями.
Знайти та вивести суму всіх елементів цього списку.
"""

l = [25, 12, 245, 65, 77]
"""
summ = 0
for i in l:
    summ += i
print(summ)
"""
print(sum(l))

"""
Задача 2: Знаходження найбільшого та найменшого елементів
Створити список з числовими значеннями. 
Знайти та вивести найбільший та найменший елементи в цьому списку.
"""

print(max(l))
print(min(l))

max_l = l[0]
min_l = l[0]
for i in l:
    if i < min_l:
        min_l = i
    if i > max_l:
        max_l = i
print(f"min: {min_l}, max: {max_l}")